Revit 2027 API
StairsComponentConnection.ConnectionType Property
 The connection type of the connected stairs component.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public StairsComponentConnectionEndType ConnectionType { get; }
Public ReadOnly Property ConnectionType As StairsComponentConnectionEndType
	Get
public:
property StairsComponentConnectionEndType ConnectionType {
	StairsComponentConnectionEndType get ();
}
member ConnectionType : StairsComponentConnectionEndType with get
Property Value
StairsComponentConnectionEndType
See Also
Reference
StairsComponentConnection Class
Autodesk.Revit.DB.Architecture Namespace